#include<stdio.h>
int main(){
int a[4] = {1, 2, 3, 4};
    int *p;
    p = a+2;
    p++;
    *p = 100;
    printf("%d",a[3]);
}
/*
int a[4] = {1, 2, 3, 4};
int *p;
p = a + 2;       // পয়েন্টারে এরের ইন্ডেক্স ২ এর ভেলুকে রাখা হচ্ছে। অর্থাৎ পয়েন্টার এখন ভেলু ৩ কে পয়েন্ট করছে।
p++;          // পয়েন্টার কে ১ বাড়ানো হচ্ছে। অর্থাৎ পয়েন্টার এখন পরবর্তী ভেলু ৪ কে পয়েন্ট করছে 
*p = 100;    // পয়েন্টার যাকে পয়েন্ট করছে তার ভেলু চেঞ্জ করে ১০০ দিয়ে দেওয়া হচ্ছে। অর্থাৎ ভেলু ৪ চেঞ্জ হয়ে ১০০ হয়ে গেল। তাই এখন এরে হচ্ছে ১,২,৩,১০০
*/
